Article.create!(
  [
    {
      id: 1,
      company_id: "13",
      genre_id: "2",
      title: "外貨建て保険入門",
      body: "テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文
            テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文
            テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文
            テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文
            テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文
            テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文",
      image: open("./db/images/article6.jpg"),
      is_active: true
    },

    {
      id: 2,
      company_id: "11",
      genre_id: "4",
      title: "お子様への教育方法について",
      body: "テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文
            テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文
            テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文
            テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文
            テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文
            テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文",
      image: open("./db/images/article7.jpg"),
      is_active: true
    },

    {
      id: 3,
      company_id: "12",
      genre_id: "12",
      title: "キャリアアップのすすめ",
      body: "テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文
            テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文
            テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文
            テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文
            テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文
            テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文",
      image: open("./db/images/article8.jpg"),
      is_active: true
    },

    {
      id: 4,
      company_id: "10",
      genre_id: "11",
      title: "ペットのしつけ方",
      body: "テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文
            テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文
            テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文
            テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文
            テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文
            テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文",
      image: open("./db/images/article9.jpg"),
      is_active: true
    },

    {
      id: 5,
      company_id: "9",
      genre_id: "9",
      title: "育児に奮闘されている方へ",
      body: "テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文
            テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文
            テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文
            テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文
            テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文
            テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文",
      image: open("./db/images/article10.jpg"),
      is_active: true
    },

    {
      id: 6,
      company_id: "9",
      genre_id: "8",
      title: "お子様に兄弟ができた方へ",
      body: "テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文
            テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文
            テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文
            テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文
            テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文
            テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文",
      image: open("./db/images/article11.jpg"),
      is_active: true
    },

    {
      id: 7,
      company_id: "8",
      genre_id: "7",
      title: "スポーツ医学を通じた怪我の予防",
      body: "テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文
            テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文
            テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文
            テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文
            テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文
            テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文",
      image: open("./db/images/article12.jpg"),
      is_active: true
    },

    {
      id: 8,
      company_id: "8",
      genre_id: "7",
      title: "スポーツ医学から見る好成績を出すためのトレーニング方法について",
      body: "テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文
            テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文
            テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文
            テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文
            テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文
            テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文",
      image: open("./db/images/article13.jpg"),
      is_active: true
    },

    {
      id: 9,
      company_id: "4",
      genre_id: "3",
      title: "心のトレーニング",
      body: "筋トレ、好きですか？興味がないという方も是非この記事は読んでいただきたい！
            なぜかって？筋トレは身体だけではなく、心をも鍛えるからです！
            今回は主に外見よりも中身を鍛えるということにフォーカスし、筋トレの素晴らしさを解説していきます！",
      image: open("./db/images/training.jpg"),
      is_active: true
    },

    {
      id: 10,
      company_id: "5",
      genre_id: "4",
      title: "プログラミング学習のすすめ",
      body: "現在も猛威を奮っているコロナウイルス環境下では、会社に出勤せず自宅で仕事をする
            いわゆる「リモートワーク」で働く方も多くなっているのではないでしょうか。今回のような環境になったことで、
            今後より一層リモートでの働き方というのも拡大していくと予想されます。それはそのような働き方、サービス自体を
            作る技術者「エンジニア」がいてこそ成り立ちます。また、現在プログラミングは全国の小学校で必修科目となり、
            非常に注目が集まっています。ここでは、そんな小学生のお子様がいらっしゃる方や、これからプログラミングを
            学びたいと思っている方向けに、学習についてのアドバイスを述べていきたいと思います！",
      image: open("./db/images/study.jpg"),
      is_active: true
    },

    {
      id: 11,
      company_id: "1",
      genre_id: "1",
      title: "健康的な食生活について",
      body: "こんにちは！ヨントリーホールディングスの神田と申します！
            いきなりですが、皆さんは毎日の食生活、気にしてますか？？
            って聞いてますけど、僕もなかなか毎日意識して過ごすことはできてません。
            たまには不健康な食べ物も食べたくなりますよね！（ラーメン、焼肉、お酒、etc..）
            でもそんな食生活を続けると、いつか身体にボロが出てしまいます。悲しいですね。
            病気になってしまえば不健康で最高に美味しい食べ物も食べられなくなってしまいます。
            そうならないために、今回はそんな食生活に関するお話をしていきたいと思います！",
      image: open("./db/images/vegetables.jpg"),
      is_active: true
    },

    {
      id: 12,
      company_id: "2",
      genre_id: "2",
      title: "資産運用の必要性",
      body: "こんにちは！株式会社三菱USJ銀行の中川と申します！
            皆さんは資産運用って聞いたときに、どんなイメージを持ちますか？
            「難しそう」、「ギャンブルでしょ」、「興味はあるけどやれないでいる」
            様々お思いのイメージがあるかと思います。ではもう一つ質問です。
            「あなたは将来のお金に関する不安がありますか？」
            この質問に対してはほとんどの方が 「ある」と答えるのではないでしょうか。
            特に働き盛りの方を中心とした若年層は、家族や恋人がいたり、友達との付き合いだったり、
            あるいは趣味に没頭したり、何かとお金が必要ですよね。
            ところで皆さんは2018年に話題になった「年金2000万円問題」を 覚えていらっしゃいますか？
            当時流れたニュースで、年齢に関わらず多くの方が将来への不安を覚えたかと思います。
            僕もそのうちの一人です。
            しかしながら、あの騒動において金融庁の本当の狙いは、老後に備えた資産形成つまり
            「貯蓄から投資」への流れを後押しすることにありました。理由としては以下の２つがあり、
            ①長寿化に伴い必要なお金が増えることによって、自身の資産寿命を伸ばす必要があること。
            ②高齢化が進むことにより、金融商品に対する判断能力が低下する人が増えること。
            ということにあり、これらを踏まえ、①個人に対しては
            「自分の将来の生活をしっかりと考え、自身で資産の管理をすべきであるということ」
            ②我々銀行などの金融商品販売業者に対しては
            「これに伴う顧客本位の販売を重視すべきであるということ」
            を訴えたかったのです。
            ですが、あの報道にはその本質というものが描かれていなく、
            「老後生活を過ごすには2000万円必要」
            という部分のみが切り取られて報道されたことで多くの方が不安を感じ騒動になりました。
            金融庁の伝え方とメディアの報道がうまくなかったとはいえ、
            その本質に関しては真であると僕は感じます。
            そこで今回はその不安の解消のために、
            いくつかの資産運用の方法をものすごく簡単に噛み砕いてお話ししていきたいと思います。
            1. 投資信託
            資産運用初心者にまずおすすめしたいのは投資信託です。
            投資信託って何かというと
            ①成長してる会社にお金を貸す（投資信託の購入）
            ②会社は借りたお金を元手にさらに事業を頑張る→頑張ると会社として利益が出ます
            ③利益が出たことで会社がさらに成長する→感謝のお礼として配当金がもらえる
            実際には景気の変動や為替の変動、経済指標によって値動きがありますが簡単にいうとこんな感じです。また配当金に関しても分配型と再投資型がありますが、ここでは割愛します。
            配当金がもらえると嬉しいし、投資した会社を応援したくなっちゃいますね！
            ただし、現在の法律ではせっかく投資で得た利益には税金がかかってしまいます！
            しかしながら、利益に対して税金がかからない方法もあります！
            それがNISAです！これには一般NISAと積立てNISAがありますが、
            前者は自分の好きなタイミングで購入できるタイプ、後者は少額を定期的に購入するタイプです。
            初心者の方かつ年齢が若い方には積立てNISAをおすすめします！
            理由としてはドルコスト平均法で平均購入単価が下がるから！と言いたいところですが、ちょっとだけ理解が必要なのでこれも詳細は割愛します。そんなに難しいわけではないので、詳しく知りたい方は是非弊社へご連絡ください！
            2. iDeCo
            iDeCoって聞いたことありますか？
            これも税金面で非常にメリットのある商品です！
            会社に勤めていらっしゃる方は、年末調整をしたことがありますよね。
            もし生命保険などに加入し保険料を払っている場合、年末調整で申告するとお金が一部戻ってきます。これは「所得控除」と言って、自分の収入をあえて少なくするイメージです。所得税はお金持ちになるほど高い税率になります。そのためお金持ちはいろんな方法で税金対策をするんですね。
            iDeCoも同じく所得を少なくする商品です！
            具体的には、毎月一定額を前述した投資信託や保険、定期預金といった金融商品で運用し、かつ毎月掛けた金額がそのまままるっと所得控除になるという仕組みですね。
            また、iDeCoは「所得控除」以外にも「利益に対して非課税」「受取時も控除」という全部で3つの税制メリットがある商品です。
            個人的には今のところで販売している金融商品の中ではiDeCoが最強の商品かと思います。
            ただし注意点もあり、iDeCoに関しては毎月掛け続けてたまった金額は原則60歳以降にならなければ受け取ることができません。これはiDeCoの別名である「個人型確定拠出年金」から分かるかと思いますが、iDeCoは「自分で作る年金」なんですね。そのため、受け取りは現在の法律では60歳以降となっています。
            受け取りが60歳というと若い方はまだまだ先のように思えるかもしれませんが、早く始めるに越したことはないです！なぜかというと、早く始めるとその分長く控除の恩恵を受けられるからですね。投資において最も有利なのは時間がたくさんある方、つまり若い方々です。
            長期でコツコツに勝るものはありません。
            とはいえ、若い時こそいろんな経験をしてたくさん遊ぶべきです！
            資産形成を全てiDeCoに回すのではなく、投資信託やはたまた定期預金として持っておくことも必要です。何事もバランスが大事ってことですね！
            以上、簡単ではありましたが初心者におすすめの資産運用方法でした！
            資産運用はお金を増やすことが目的ではなく、むしろ守ることが目的です。
            今回の記事をお読みになり、少しでも資産運用について興味を持っていただけると幸いです。
            まだまだお伝えしたいことはありますが、今回はこの辺で。
            最後までお読みいただきありがとうございました！　
            今回の記事について詳しく聞きたい方は右下の「この記事の話をもっと聞きたい」からどうぞ。",
      image: open("./db/images/money.png"),
      is_active: true
    },

    {
      id: 13,
      company_id: "3",
      genre_id: "3",
      title: "美しく生きること",
      body: "近年、美容業界は目まぐるしい成長を遂げております。
            化粧は女性のするものという概念から一転し、最近では化粧をする男性も増えてきており、
            今後もより一層、市場は拡大していくことでしょう。それは、生きる上での多様性が徐々に
            認められつつあるということでもあります。最近では「LGBT」という言葉が広まりつつありますね。
            セクシュアルマイノリティを表す言葉のひとつ、「LGBT」。ここではそんなLGBTについて
            お話ししていきたいと思います。",
      image: open("./db/images/beauty.jpg"),
      is_active: true
    },

    {
      id: 14,
      company_id: "3",
      genre_id: "3",
      title: "美容に良い意外な食べ物",
      body: "こんにちは！株式会社光星の水谷と申します！
            いきなりですが、皆さんは最近話題になっている美容に良い意外な食べ物ってご存知ですか？？
            テレビを見ている方ならご存知の方も多いかもしれませんね！そう！ちくわです！！意外でしたか？？？ちくわには豊富なタンパク質が含まれており、
            腹持ちもいいので小腹が空いた時のおやつとしてはものすごくいいんです！！
            ダイエットにももってこいで巷ではちくわダイエットなるものも流行りはじめているとか？
            これで明日からスーパーのちくわが売り切れちゃいますね！皆さんも是非お試しあれ！！
            この記事が気に入ったらお気に入りをよろしくお願いします！
            また弊社では美容に関するたくさんの記事を投稿していますので
            是非会社のフォローをよろしくお願いします。",
      image: open("./db/images/beauty2-article.jpg"),
      is_active: true
    },

    {
      id: 15,
      company_id: "7",
      genre_id: "6",
      title: "スマートな服装の作り方",
      body: "こんにちは！セカンドリテイリングHareyaka掲載担当の佐藤です！
            今回は、タイトルにもある通り、スマートな服装の作り方についてお話ししていきたいと思います！
            皆さんはどんな服装がお好きですか？様々あると思いますが、私は割とシンプルな服装が好きで自分の旦那にも
            無理やり私が選んだものを着させたりしてます！笑夏なら上のようなハーフパンツスタイルが爽やかで素敵ですよね！
            モデルさんがクールすぎる問題もあるかもしれませんが...笑でも！こんな服装って実はある法則があるんです！
            それを実践するだけでスマートでカッコよく見せることができます！その法則とは...
            服装全体のカラーバリエーションを3〜4色に限定する！これだけです！モデルさんを見てください！
            実はこの服装も４色にまとめているんです！モデルがかっこいいだけかと思ってたらちゃんと法則があるんですね！
            これでシンプルスマートお洒落でカッコいい服装の出来上がりです！！！！皆さんも実践してみてください！
            次回の記事もお楽しみに！！今回の記事が気に入ったら是非お気に入りしてみてくださいね！フォローもよろしくお願いします！
            また、弊社ではファッションに関する記事をたくさん掲載しておりますので、気になる記事やファッションに関するお悩みがあれば、
            右下の「この記事の話をもっと話を聞きたい！」からお気軽にご連絡くださいませ！
            セカンドリテイリングHareyaka掲載担当　佐藤",
      image: open("./db/images/article15.jpg"),
      is_active: true
    },

    {
      id: 16,
      company_id: "6",
      genre_id: "5",
      title: "今年も開催します！",
      body: "こんにちは！株式会社グルメアソシエーションズの高橋と申します！いよいよやってきましたこの時期が！そう！
            バレンタインデーですね！毎年この時期はどこに行ってもチョコチョコチョコチョコで、ソワソワしちゃいますよね〜〜
            まあ、私はいつも家族にあげているだけなんですけどね！余談はさておき、今回はタイトルにもある通り、あの企画です！
            そう！毎年恒例「株式会社グルメアソシエーションズ主催　バレンタインお菓子作り教室」〜！！
            毎年たくさんの方にご参加いただき高橋は大変感謝しております！ただし！今年はまた一風変わった企画です！
            今回は女性だけでなく、男性も募集します！それじゃあ、いつものお料理教室と変わらないって？
            そんなことはありません！今回の企画の本当のテーマは「そんなに熱くちゃチョコが溶けちゃう！男女混合お見合いバレンタイン」〜〜！！
            言うとりますけども。はい、今回はお菓子作り兼参加者のお見合い企画もやっちゃおうじゃないかということで
            その場で男女グループになって一緒にお菓子を作ってもらい、仲を深めてもらおうと言う企画でございます！
            まあ、中には撃沈してしまう方もいらっしゃるかもしれないですが、
            世の中には弱肉強食という言葉がありましてですね...
            高橋ももれなく弱肉でございますのでご安心ください。
            そんな方は、是非またお料理教室に参加していただいてお料理の腕を
            高めていただければと思います！料理がうまい人はモテるって聞いたのでね！
            ちなみに今回作っていただくお菓子は
            ティラミスです！！
            ティラミス（イタリア語: Tiramisù、ヴェネト語: Tiramesù [tirameˈsu]）は、北イタリア生まれのデザートの一種。語源の Tirami su! はイタリア語で「私を引っ張りあげて[1]」、また転じて「私を元気付けて」に由来する。出典: フリー百科事典『ウィキペディア（Wikipedia）』
            はい、急にガチガチになりましたが、
            男性の皆さん、是非女性をリードして引っ張っていってあげてください！
            Tirami su〜〜〜〜〜〜!
            ということで最後になりますが、詳細は下記に記載しておりますのでお気軽にご参加くださいませ！
            皆様のご参加お待ちしております！
            【日時】2021/02/14　13時〜
            【場所】東京都港区六本木100丁目100-10-1 
            株式会社グルメアソシエーションズ東京本社　1F料理教室フロア
            【参加費】5000円
            ご応募先】記事右下の「この記事の話をもっと聞きたい！」から株式会社グルメアソシエーションズのマイページへお進みいただき、DMからご参加の旨をメッセージください！",
      image: open("./db/images/article16.jpg"),
      is_active: true
    },

    {
      id: 17,
      company_id: "6",
      genre_id: "10",
      title: "たった一手間加えるだけでまるで高級フレンチ！？",
      body: "こんにちは！株式会社グルメアソシエーションズの高橋です！
            いきなりですが皆さんは料理を作る時、どんなことに気をつけていますか？？
            「レシピを見てその通りにやる！」「隠し味に蜂蜜！」
            様々あるかと思います！
            ちなみに高橋はスピード重視の簡単料理ばかり作るので参考にはならないので言及しませんが
            今回は普段作っている料理にたった一手間加えるだけで
            まるで高級フレンチのようにおいしくなってしまう
            魔法のようなテクニックをお教えしていきたいと思います！
            弊社でも実際に使っているテクニックですので必見ですよ！
            【テクニックその１　お魚編】
            まずはお魚編です！
            ポイントは下処理をしっかりすること！
            魚料理で一番大切なことは臭みぬきです！
            生臭いお刺身はとてもじゃないけど食べれませんよね。
            魚の生臭さを取るには塩水処理が重要です！
            たっぷりの水を用意してそこに塩を入れ塩水を作りましょう。濃度は3％程度が目安です！
            1ℓに対して30gほどですね！
            塩水ができたらおろした魚を入れ、１分程度浸けてあげましょう！
            これでも臭みが取れない場合は直接塩を振ってあげて５分程度待ってあげると
            臭みの原因の水分が出てきますのでそうしたらたっぷりの水で洗い流してください！
            再度申し上げますが、魚は下処理が命です！
            特にお刺身を食べる時は臭み抜きをしっかりしてあげてくださいね！
            【テクニックその２　お肉編】
            ポイントは切り方です！
            これはお肉以外にも言えることですが
            繊維がある食べ物は、切り方次第で格段においしくなります！
            お肉を柔らかく仕上げたい時はお肉の筋繊維に対して垂直に。
            あえて食感を楽しみたい時は平行に。
            これを知っているだけであなたの料理は格段においしくなりますよ！
            ということで！
            以上、料理をおいしくする一手間でした！
            いや〜今回の高橋のお話は為になるものばかりで一味違いました！
            そう、料理だけにね
            ハンバーーーーーーーーグ！！！！！！！！！！！
            まあハンバーグ全然関係ないしもっといえばハンバーグはミンチなので切り方も関係ないんですが。
            次回は美味しいハンバーグの作り方でも書いてみるかね。
            最後までお読みいただきありがとうございました！
            この記事を気に入った方は是非お気に入りをお願いします！
            また株式会社グルメアソシエーションズでは、料理に関する記事を多数掲載しておりますのでよろしければフォローも是非お願いします！
            普段の料理でお悩みのこと、ご相談があれば弊社までご連絡ください！
            株式会社グルメアソシエーションズ　高橋",
      image: open("./db/images/article17.jpg"),
      is_active: true
    },

    {
      id: 18,
      company_id: "14",
      genre_id: "1",
      title: "記事タイトル",
      body: "記事本文記事本文記事本文記事本文記事本文記事本文記事本文記事本文記事本文記事本文記事本文記事本文記事本文
            記事本文記事本文記事本文記事本文記事本文記事本文記事本文記事本文記事本文記事本文記事本文記事本文記事本文
            記事本文記事本文記事本文記事本文記事本文記事本文記事本文記事本文記事本文記事本文記事本文記事本文記事本文
            記事本文記事本文記事本文記事本文記事本文記事本文記事本文記事本文記事本文記事本文記事本文記事本文記事本文
            記事本文記事本文記事本文記事本文記事本文記事本文記事本文記事本文記事本文記事本文記事本文記事本文記事本文
            記事本文記事本文記事本文記事本文記事本文記事本文記事本文記事本文記事本文記事本文記事本文記事本文記事本文
            記事本文記事本文記事本文記事本文記事本文記事本文記事本文記事本文記事本文記事本文記事本文記事本文記事本文
            記事本文記事本文記事本文記事本文記事本文記事本文記事本文記事本文記事本文記事本文記事本文記事本文記事本文",
      is_active: true
    }
  ]
)