Article.create!(
  [
    {
      id: 1,
      company_id: "1",
      genre_id: "1",
      title: "健康的な食生活について",
      body: "テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文
            テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文
            テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文
            テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文",
      image: open("./db/images/vegetables.jpg"),
      is_active: true
    },

    {
      id: 2,
      company_id: "2",
      genre_id: "2",
      title: "資産運用の鉄則",
      body: "テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文
            テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文
            テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文
            テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文",
      image: open("./db/images/money.jpg"),
      is_active: true
    },

    {
      id: 3,
      company_id: "3",
      genre_id: "3",
      title: "美しく生きること",
      body: "テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文
            テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文
            テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文
            テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文",
      image: open("./db/images/beauty.jpg"),
      is_active: true
    },

    {
      id: 4,
      company_id: "4",
      genre_id: "3",
      title: "心のトレーニング",
      body: "テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文
            テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文
            テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文
            テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文",
      image: open("./db/images/training.jpg"),
      is_active: true
    },

    {
      id: 5,
      company_id: "5",
      genre_id: "4",
      title: "プログラミング学習のすすめ",
      body: "テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文
            テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文
            テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文
            テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文テスト本文",
      image: open("./db/images/study.jpg"),
      is_active: true
    }
  ]
)